#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9bb0cba-9618-4047-965d-ed18f14a782e]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=52053958-e8cb-4689-af33-ffbf7c08a503]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6c1c5a7-9c27-4c87-8e5e-516fdc06628e]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b15c5c8e-c382-478c-9379-d57e77624cf1]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edc0aa1e-ba42-4b33-9aa0-bcc3c853b22d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fa46fbc7-df18-4d40-bac8-f90276d596f9]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2cc06bf6-6ce0-403a-a596-f2d85cd3e64d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=11463c0e-ffcb-4620-90d5-d3bc3453b6b3]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6bfab1cc-4a36-47ba-be77-8961227d6ad6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6ec25acf-d041-4c82-8d53-0f2df5bb8484]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aa6681ca-aa63-4fab-93a4-5297ec667657]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=93ce7085-7fbe-4fed-b401-1660f3de7ab3]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2ebc2145-eccd-40ae-8dd3-d65ec813c855]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=837635b3-fc3a-4442-9148-451f1b74ca55]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=753fae22-08a1-40e1-b798-0594a06fa2ce]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=be0aa06a-ee89-4e78-adc5-0c8cbb00f12e]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bced4142-2101-4cf4-a128-5880ad0df3cd]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c22ef4ed-6dd3-49fa-bcb5-64c6aaedd04b]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3f6f4d94-f380-4493-8bd3-4d6f4a91897e]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a298f52a-d114-49f5-b650-c50b656ca4a6]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["bceid-approver"]: Refreshing state... [id=a6bebcae-5a6a-44f9-8f98-5b2a99d281d0]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9cdc2c58-be72-401c-89bd-6d066e6c5ae9]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16b42c20-54db-4b49-94fb-bce3fd911c16]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f0808d6b-4266-4b88-8f1d-b1015ea17b71]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["sso-admin"]: Refreshing state... [id=7573518c-3197-40f0-b553-16d57112c5fc]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fb58d49-7dec-4bfd-95af-ac495e2ce6d8]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=95a7435e-5034-4492-aebc-dcc4ee41a770]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ce032226-6a7b-435d-9a50-8143f672c7f7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e7ffaa1e-58a8-4436-9e0b-0abd0ad5e4cc]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=49a7b096-a394-4977-871c-f82ed3e18bc5]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2cbcd95a-59a1-4ec0-a026-7e6696f73065]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0518c07f-9ead-4916-824c-659f1308faaa]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a87bd1e-672c-4951-87a4-0fe8ba39874a]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=04ba8eb7-c9fd-4d9a-baa0-e6777eb41b48]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a0c526ee-ad85-40b2-b55f-f3c1fec76376]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a4646600-ef19-485f-b978-1cb5eab28063]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cda1a7ee-a75b-45bf-b6da-806ade452763]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d11cb4ad-87e7-4695-90bf-96993f9ee3f6]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d1a8a9cb-6b99-4a85-bb92-fe72bd201a4a]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5eac6ffe-edd5-4b0f-887f-f3961dd7b309]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=69163f74-93fa-4327-a8c1-2c901b111840]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2c72dd45-e918-4c97-b19b-c9a722d587be]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3f6a0001-d1f8-4af7-8845-2c88322acb99]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=83b49158-f223-4437-aab9-6e9606288459]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3e7bb270-1034-428b-a7e2-baa9589bf26c]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3d2ac763-a8f0-4c06-9135-6308333041c4]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e0bdcd5a-5d9e-4a09-aa15-26398a69f91e]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2475a249-85bb-4739-8a20-6cdd7a12b8a1]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=735825ff-1d35-4f5e-a386-925b19d5a959]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=72cd06b9-1012-4eef-8a53-c2f8f5e3368a]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1086f4a1-9bd0-4955-8e0b-082db64e4d57]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=469f7f33-8fc7-4daf-b210-8700bff04e1e]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=756740f3-c128-4b1a-93b2-3d66f64fd18d]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0d6eafb5-48fe-4ccf-ae03-e4bd74958dd2]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3269e1c7-bab7-4b20-99f9-e8e993214dcb]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=571bbc1b-8e5b-4ee2-8fcd-1936113dbca6]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=98f6e308-ad01-499a-8ab3-658e86abea54]
module.keycloak_prod.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=448e951b-4651-404b-8576-980b6d980a78]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f8d29894-9442-481b-84c7-2710f4fcf286]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2b10b726-5126-4ac7-89ca-a41ecb895b29]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0c0c152f-229e-4785-9181-1f5dbb9ef313]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3b0e2b84-6bb7-490f-945b-f445412f42ab]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fbb9e2b7-1d6f-4fb9-af01-f13167e2d307]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d2e47f4f-e189-4edd-96f4-dab8a36a4d76]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=16585048-0468-4659-82cb-554c6bc34651]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=adae4615-dc92-47ad-b8c1-bab1cdec130a]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e0138bac-0504-4d25-b77e-53df51d31277]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b9c6d2ea-569b-4f08-85b8-13d8cd6d4549]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6cd61d3-681a-4684-9dcb-d5736e662c3f]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f870a8e6-b2bd-4623-8348-5ba394726b7e]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0785f4b7-766a-44cb-b1fd-65adb6962219]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8cb97eea-1e73-4373-a5ca-98045a3ae662]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cef3f01b-2030-43fd-8bc9-5665696ffe91]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1361b14b-15b6-47ce-af82-ce360c253caf]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=970853b9-d6e9-435a-85d1-ccfa2ef7333a]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8e10db56-a232-499a-b811-16d6e03b1125]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=61ba36cc-85c4-4a29-9ec6-24d8f084a2ef]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=83941374-268e-41af-8643-19483553efb7]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5edc7c8b-04f1-4b82-b2f7-861d864a7cb9]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8774bb90-ce0f-4955-b990-1387864b4dfe]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=328730fd-9df2-406d-b43d-0e5b450c6ed0]
module.keycloak_prod.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a2e859af-f7d5-4757-bf9b-677f4ef85bf2]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c4158cca-c5a0-4a5c-9339-1fa87acfdd5c]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_openid_client.this: Refreshing state... [id=11f776ce-f75a-497c-b9e1-d34ca94d4b9b]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8fae1957-fc42-4d0a-a16d-f80967e5be74]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e3855b48-5b52-4ad1-a998-f8d3737bc951]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8c1ef37a-f490-4930-9872-bdc679b86d41]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_openid_client.this: Refreshing state... [id=452de387-33e5-4cb4-9d2a-64f58dc5008f]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=03d53390-0147-47ad-875a-a9f0927b9bfc]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3652228-cde4-4b18-94c8-7ad95dd2c75e]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3da90b88-8373-4935-821f-105dd858915c]
module.keycloak_prod.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=52d4e6cc-a048-441e-80e6-3208b744785b]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=e1ad3b73-8922-4609-bf1f-75646cfaa7f4]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5e74057-c94f-4a30-b18c-84fb1d500477]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d59efa72-b2de-4586-895e-aefce069184c]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5a60d017-1041-45de-857a-a86f27c37dea]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94ff68ca-1fd6-446d-847b-7d6ad9392901]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ac4101b1-a5f1-4552-90df-639831c6d7d8]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ce54c332-46a6-4f14-9e3f-be5e5b933ff1]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fe253f42-fa4c-4de5-931c-5d2eb5a06072]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ee5f65ba-c02b-438b-9779-b790910e0db0]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b04206d6-d37b-44c9-b76e-2cbddec96ded]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4ff00512-dc13-4356-8e0f-8fee2715ce0e]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e2ffc5a-d75c-4af8-ad2f-0e615a9b6cc9]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0268a0bd-210c-4cab-87db-4b4515b740dd]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a872eecf-9d54-4c1a-9700-d3773bc68c47]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e71af3b2-7fff-46ec-b395-654d515095b7]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfc7b2f4-69dd-4b01-a3cc-bb82a0b1ef3f]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=de9c0fba-8bfb-4aee-a657-421c2984a085]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=26176a12-6339-4490-a705-b7e17253a1ff]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22dccf37-6825-49ee-ba44-571c01a6bd39]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1a312e7e-96c2-41d1-9dd4-dff6b0f4e81f]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab08314c-ea04-4c22-821d-9040eb74269a]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=161d9e07-d68b-4947-a51c-d692c84846b1]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2943082f-38ae-4030-a66c-61a8ade9de51]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=63427cdd-76ac-4c26-b075-780d1386f05a]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c32ad305-13ab-44bd-83c6-f1d1cb5f4525]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b03898ff-4879-4215-8a48-14c1a5a1d403]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c0a7a2a-332c-4d7b-82d3-70a8d91c02be]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c0560048-7b7c-4259-8ce3-dfee0d977ce5]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=77eec50e-f6ca-48cc-8c8d-6efc4a588bb7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3b6e76c9-9083-4d86-9ceb-9580c2eda649]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63937871-a3e2-418d-aee6-947ccafeabe2]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3e106a58-cf5c-40bd-b8d8-f6442eddbb6c]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ea5c127b-e074-454e-851a-02420ee8bd8b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "awp-2146"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "awp-2146"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_awp-2146.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "awp-2146"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "awp-2146"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://dev-awp.th.gov.bc.ca/",
        ]
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "awp-2146"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "awp-2146"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "awp-2146"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "awp-2146"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://tst-awp.th.gov.bc.ca/",
          + "https://uat-awp.th.gov.bc.ca/",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 644 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*